---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.GetHashCode
source: html/35e9f0b1-e277-5935-fdb8-a8a9397ed2d1.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.GetHashCode Method

Gets the integer value of the id as hash code

## Syntax (C#)
```csharp
public override int GetHashCode()
```